[{"data":1,"prerenderedAt":559},["ShallowReactive",2],{"sanity-dYLl4R-UbxseLj1iHppBvvq5NgsF4YWG62jl7k4P7zY":3,"sanity-SJcRA2M5vimuknJuO8BEGWat9XUoWwwEQleliLzy06E":233},{"homePage":4,"mainNav":184},{"content":5,"slug":175,"_createdAt":178,"_rev":179,"_type":180,"_id":181,"title":182,"_updatedAt":183},[6,121,150],{"image":7,"orientation":23,"_type":24,"_key":25,"body":26},{"image":8,"caption":22},{"hotspot":9,"_type":15,"asset":16,"crop":19},{"x":10,"y":11,"height":12,"_type":13,"width":14},0.4551547324820742,0.3892414912638451,0.767581695364564,"sanity.imageHotspot",0.7455344004173802,"image",{"_ref":17,"_type":18},"image-412046c6e9a5d66575ecf639a33464597d6058b2-2048x1365-jpg","reference",{"top":20,"left":20,"bottom":20,"_type":21,"right":20},0,"sanity.imageCrop","Sophie & Natasha","imageLeft","imageText","34c4435951fb",[27,43,51,71,78,95,102],{"_type":28,"style":29,"_key":30,"markDefs":31,"children":32},"block","normal","30b0d1aa7a44",[],[33,39],{"marks":34,"text":36,"_key":37,"_type":38},[35],"strong","juno midwives","3f229f129dc1","span",{"marks":40,"text":41,"_key":42,"_type":38},[]," are NMC registered, independent midwives, with over 22 years combined experience and a passion for providing personalised midwifery care. You can rest assured you’re in great hands with us.","f7c1b3f3aeac",{"style":29,"_key":44,"markDefs":45,"children":46,"_type":28},"458785997b22",[],[47],{"marks":48,"text":49,"_key":50,"_type":38},[],"","e9c1416b69fe",{"children":52,"_type":28,"style":29,"_key":66,"markDefs":67},[53,57,62],{"_key":54,"_type":38,"marks":55,"text":56},"052e2749650e",[],"Our enhanced ",{"_type":38,"marks":58,"text":60,"_key":61},[59],"9b5994a49520","care packages","da30448bb051",{"text":63,"_key":64,"_type":38,"marks":65}," are personalised to you and your wants and needs. With flexible, unhurried appointments held at your home and direct access to us via WhatsApp throughout your care, you’ll experience next-level pregnancy care.","4c936176b590",[],"4a548eb1e37b",[68],{"_key":59,"_type":69,"href":70},"link","/care-packages",{"_key":72,"markDefs":73,"children":74,"_type":28,"style":29},"04f337c2eeb5",[],[75],{"text":49,"_key":76,"_type":38,"marks":77},"0eef42ff8209",[],{"_key":79,"markDefs":80,"children":81,"_type":28,"style":29},"ec934ef75f1c",[],[82,86,91],{"_type":38,"marks":83,"text":84,"_key":85},[],"We respect that ","873e8e4446c4",{"text":87,"_key":88,"_type":38,"marks":89},"you","848a0862afe5",[90],"em",{"_type":38,"marks":92,"text":93,"_key":94},[]," are the ultimate decision maker in your pregnancy, birth and postpartum and we believe that you should be nurtured and supported on this life-changing journey.","04af9ac1cb04",{"markDefs":96,"children":97,"_type":28,"style":29,"_key":101},[],[98],{"_type":38,"marks":99,"text":49,"_key":100},[],"8986566589d7","2def4ddf8c12",{"style":29,"_key":103,"markDefs":104,"children":108,"_type":28},"b5ebf249727d",[105],{"_type":69,"href":106,"_key":107},"/philosophy-of-care","50ac74d64162",[109,113,117],{"marks":110,"text":111,"_key":112,"_type":38},[],"Our ","e1bdd535e65a",{"_key":114,"_type":38,"marks":115,"text":116},"423d02471cf0",[107],"ethos",{"_type":38,"marks":118,"text":119,"_key":120},[]," is all about respecting your rights & choices, supporting you to develop self-trust and providing you with the information and the tools to help you make decisions during your pregnancy, birth and postnatal experience. ","911cde30f6ba",{"_type":122,"_key":123,"body":124,"title":148,"centered":149},"faq","923ceaa76662",[125,133],{"children":126,"_type":28,"style":29,"_key":131,"markDefs":132},[127],{"_type":38,"marks":128,"text":129,"_key":130},[],"We are based in Folkestone and will happily travel up to an hour.","cb321d79fbad","659bc101acee",[],{"style":29,"_key":134,"markDefs":135,"children":139,"_type":28},"2822eea8fc76",[136],{"_type":69,"href":137,"_key":138},"/contact-us","ddb5d900f004",[140,144],{"text":141,"_key":142,"_type":38,"marks":143},"If you’re not sure if we cover your area\n","2c161a8d143a",[],{"_type":38,"marks":145,"text":146,"_key":147},[138],"please get in touch.","da16c8b3a160","Where do we work?",true,{"_type":151,"_key":152,"logos":153},"logoGroup","d87c59f646c3",[154,160,165,170],{"_type":155,"_key":156,"image":157},"logo","3025c8b00dfc",{"asset":158,"_type":15},{"_ref":159,"_type":18},"image-88e6507d1fdb649d8ef516d8534cd8d4c30921a6-683x194-png",{"image":161,"_type":155,"_key":164},{"asset":162,"_type":15},{"_ref":163,"_type":18},"image-98d9b32c6e21d68ff8764c8fdcf35f5207122ead-270x106-svg","af684efb25d1",{"_type":155,"_key":166,"image":167},"b96567ca6b5a",{"_type":15,"asset":168},{"_ref":169,"_type":18},"image-58a90bd776e731ba02461f42f5ee549acd0a44d4-1024x1024-webp",{"image":171,"_type":155,"_key":174},{"_type":15,"asset":172},{"_type":18,"_ref":173},"image-17ad86d32632d561378597f20bec56ef9cfa4842-1081x439-png","7e7df7dbf9c9",{"current":176,"_type":177},"home","slug","2025-03-20T13:26:20Z","ry96XMy6xGqcUNqo1oU54Y","page","d301efb5-e154-4661-b74f-ac194bed03ff","Home","2025-04-01T20:54:51Z",[185,187,192,196,201,205,209,213,217,221,225,229],{"slug":186,"title":182},{"current":176,"_type":177},{"title":188,"category":189,"slug":190},"About Us","About",{"current":191,"_type":177},"about",{"slug":193,"title":195,"category":189},{"_type":177,"current":194},"philosophy-of-care","Philosophy of Care",{"slug":197,"title":199,"category":200},{"current":198,"_type":177},"care-packages","Care Packages","Services",{"slug":202,"title":204,"category":200},{"current":203,"_type":177},"tests-in-pregnancy","Tests in pregnancy",{"title":206,"category":200,"slug":207},"Antenatal care",{"current":208,"_type":177},"antenatal-care",{"category":200,"slug":210,"title":212},{"current":211,"_type":177},"labour-birth","Labour & birth care",{"category":200,"slug":214,"title":216},{"current":215,"_type":177},"postnatal-care","Postnatal care",{"slug":218,"title":220,"category":200},{"current":219,"_type":177},"local-services","Local services",{"slug":222,"title":224},{"current":223,"_type":177},"birth-stories","Birth Stories",{"slug":226,"title":228},{"_type":177,"current":227},"faqs","Frequently Asked Questions",{"slug":230,"title":232},{"current":231,"_type":177},"contact-us","Contact Us",[234,352,421,498],{"_updatedAt":235,"_id":236,"title":237,"slug":238,"publishedAt":240,"content":241,"_rev":346,"image":347,"_type":350,"_createdAt":351},"2025-04-02T20:27:48Z","1dd979de-b1ab-4067-8f70-a2feeec89a14","Sophie & Sam’s Twin Hospital Birth Story",{"current":239,"_type":177},"sophie-sams-twin-hospital-birth-story","2024-09-01T20:27:00.000Z",[242,250,258,266,274,282,290,298,306,314,322,330,338],{"style":29,"_key":243,"markDefs":244,"children":245,"_type":28},"f5868b4cf6fe",[],[246],{"_type":38,"marks":247,"text":248,"_key":249},[],"We found out we were expecting twins when I was 21 weeks pregnant, at the anomaly scan. I had declined the 12-week scan and had chosen not to book my pregnancy care with the NHS at that point. Twins were not on our radar so to say we were surprised is an understatement! I’d always known I would plan a home birth if I had a baby and decided I would stick with planning a home birth with my twins, if I was well, and they were well. Natasha was my midwife throughout my pregnancy, although I did a lot of self-midwifing too! I booked with the NHS at around 23 weeks as I wanted to be in their system in case the twins decided to come early.","63acde60315c",{"_type":28,"style":29,"_key":251,"markDefs":252,"children":253},"1fb6246ef4c0",[],[254],{"text":255,"_key":256,"_type":38,"marks":257},"My pregnancy was plain sailing up until about 40 weeks when I developed pre-eclampsia. I had high blood pressure and protein in my urine but otherwise felt well. I started on antihypertensive medicine which helped to bring the blood pressure down slightly. I declined induction of labour at this point as I felt confident that the babies were well and wanted to monitor the pre-eclampsia instead.","285a25570703",[],{"style":29,"_key":259,"markDefs":260,"children":261,"_type":28},"cd60bcd9ce86",[],[262],{"_type":38,"marks":263,"text":264,"_key":265},[],"At 40+6 I went into labour after watching the Olympics on TV all afternoon (plenty of feel-good hormones going around!). My labour felt like it started thick and fast, I recall texting Natasha asking if I was being a wuss as I didn’t feel like I’d been contracting for very long, but they were very strong. I put the TENS on and was mobilising around as much as I could, although I’d developed pelvic pain in the final few weeks of pregnancy so moving was very painful. Pretty soon I asked Sam to fill the pool up – hoping the water would provide relief. I got into the pool and it did feel nice, although contractions continued to come one on top of the other. I asked Sam to call Natasha at this point.","bd60673296d7",{"children":267,"_type":28,"style":29,"_key":272,"markDefs":273},[268],{"_key":269,"_type":38,"marks":270,"text":271},"1476cb741fd3",[],"Natasha arrived and I was relieved to see her. I declined any monitoring of myself or the babies. The babies were very wriggly, so I had no concerns about their well-being. Contractions continued to come back-to-back with very little respite, but I knew birth wasn’t close. I asked for a vaginal examination – I’d attempted a self-examination prior to this but my bump was so huge and the first baby’s head still high in my pelvis that I couldn’t feel a thing. I wanted to know what my cervix was up to and where the first baby was in my pelvis to try and make sense of the mega contractions I was having. My cervix was 2cm dilated and the baby’s head was at ‘spines’ in my pelvis. I got back in the pool and after a small lull in contractions, they came back in full force – long, strong and back-to-back. I was vomiting a lot and peeing became increasingly difficult – sitting on the toilet was excruciating and I would have a very long contraction every time I tried. 5 or so hours after my previous vaginal examination, I requested another – at this point I wanted to make a decision about whether to stay at home or transfer to hospital for pain relief and because a couple of things just felt ‘off’. Again, I didn’t feel like the birth was imminent…but my contractions were relentless, and I knew that the vomiting and being unable to pee were not the best signs! This time my cervix was 4cm dilated and the baby was in the same position. I decided to transfer to hospital for an epidural as I did not feel I was about to have the babies imminently and the hours of intense, long and very regular contractions was taking its toll on me. Natasha called the hospital to let them know we were coming in and then we drove in. As this wasn’t an emergency transfer, we chose to drive as an ambulance transfer was going to take 2 hours.","3d1409d68fcd",[],{"children":275,"_type":28,"style":29,"_key":280,"markDefs":281},[276],{"marks":277,"text":278,"_key":279,"_type":38},[],"On arriving at the hospital, I was immediately put in a room on labour ward and assigned a midwife. After having a cannula sited, a scan to determine the positions of the babies and a CTG commenced…I had the epidural. I started feeling pain relief soon after this. The scan showed that the second twin, who had been head down all pregnancy, had flipped to being in the breech position – which was a surprise as I was amazed he had any space to do such a big move! I had a good chat with the consultant about my birth plan and what I did and didn’t want – it felt like a respectful discussion and at no point did I feel like I was being pushed into one thing or another. When I was comfortable, we sent Natasha home to get some rest as she had been up all night with us and I felt like I was in good hands with the team who were on shift at the hospital that day.","2304da815752","ef5b5e38898e",[],{"style":29,"_key":283,"markDefs":284,"children":285,"_type":28},"ad223aee028a",[],[286],{"marks":287,"text":288,"_key":289,"_type":38},[],"At my next examination, which I’d requested to be later than the routine 4 hours after my previous one, my cervix was 8cm dilated. Contractions were still coming regularly without any need for the hormone drip (this can often follow an epidural!), and the babies were happy. At the next examination my cervix was 9cm dilated and the first baby was still at ‘spines’. I asked for the waters of the first twin to be broken as I wanted an FSE clip put on to monitor their heartbeat. Prior to this, monitoring was only possible in one very specific position on my abdomen, which meant changing position was difficult as we kept losing contact. Upon breaking my waters, there was thick meconium – which didn’t faze me as I was 41 weeks and knew my babies were happy because of all the movements. After the FSE was applied I was able to lie on my side and use a peanut ball – I was trying to encourage the first twin to rotate and descend!","4e9877d973e1",{"children":291,"_type":28,"style":29,"_key":296,"markDefs":297},[292],{"marks":293,"text":294,"_key":295,"_type":38},[],"My epidural started to become ineffective at some point and I had a lot of breakthrough pain, which after having pain relief for several hours, was rather unpleasant. After breaking the waters I also started to feel lots of pressure in my bottom. This felt quite exciting (although I had sent Sam home to grab some bits…whoops!) as it was the first time I’d felt like the babies might be close. This sensation went on for an hour or so and I had another examination, which confirmed my cervix was fully dilated…but I knew immediately that the first twin was still in the same position in my pelvis. I remember saying to the midwife something along the lines of, ‘the baby’s not just sitting there, your fingers have gone too far!’. I think at this point my body was trying its best to turn the first baby into a more favourable position.","ec3f39c2053f","a97911b80b45",[],{"markDefs":299,"children":300,"_type":28,"style":29,"_key":305},[],[301],{"text":302,"_key":303,"_type":38,"marks":304},"After this the epidural wore off completely and I had to have it re-sited, which was also unsuccessful, so the anaesthetist gave me a combined spinal-epidural (CSE) and that provided some relief. I met the nighttime consultant and discussed my birth plan with him – again, I felt respected in my decisions. I then started pushing and did so for an hour or so – the CSE was providing pain relief, but I was still fully mobile, so I was able to get into lots of different positions for pushing. Although the monitoring of the babies’ heartbeats kept losing contact, which was annoying probably more so for my midwives, but I never once worried about their well-being during labour. The CSE started to wear off and I was getting nasty breakthrough pain after an hour or so of pushing. At this point I was reviewed by the consultant again and he examined me. We discussed having an instrumental assisted birth, which I felt was what needed to happen at this point. The first twin was in exactly the same position he’d been in since the start of the labour. I was asked where I wanted the instrumental birth to happen, and I requested theatre (I think to the relief of the doctor…!) as I wanted proper pain relief given that mine had worn off. There was a short delay in getting there as the theatre was busy, during which time I was huffing on gas and air as the CSE faded away.","84b81a00dbd6",[],"1d528f2116d9",{"style":29,"_key":307,"markDefs":308,"children":309,"_type":28},"3033985d8f61",[],[310],{"text":311,"_key":312,"_type":38,"marks":313},"When we got to theatre, I had a spinal sited and felt true relief as I went completely numb from the waist down. The midwives kept me informed of what was happening at each stage – I requested this as despite being numb, I strongly believe that we should know what’s happening to our bodies in theatre! I also requested my head be raised so I could see the doctor more clearly – my midwife brain was very much engaged. A ventouse was attempted but after a few pulls, the consultant said it wasn’t going to work. He asked at that point if I wanted him to try forceps (which he was confident he could do) or if I wanted a caesarean section. I said I would rather attempt a vaginal birth than have a caesarean…even though I knew this would mean having an episiotomy – something I had reiterated that I really did not want unless absolutely necessary. I said that I accepted that I would need an episiotomy in this scenario and remember thinking what a bummer it would be if the second twin then needed to be born via caesarean section..!","a16f01b2febf",[],{"children":315,"_type":28,"style":29,"_key":320,"markDefs":321},[316],{"_key":317,"_type":38,"marks":318,"text":319},"becb0300167b",[],"So, the first twin, Finn, was born via forceps and placed onto my abdomen skin-to-skin, where me and my midwife provided some gentle stimulation as he was a little surprised to be born. His cord was quite short and after about 4 minutes, it was clamped and cut. Then, 22 minutes later, the second twin, River, was born also with the help of forceps. River had flipped himself head down following the birth of Finn – there had been no scanning or stabilising, he’d just done it himself. Pushing with a spinal is the weirdest feeling – you really don’t feel like you’re doing anything, but you get told that you are and, in my case, have a team of friendly theatre staff all rooting for you. River also was placed skin-to-skin and had about 3 minutes before his cord was clamped and cut. Then my two, good sized babies were on my chest! Wild.","91646a53fed6",[],{"markDefs":323,"children":324,"_type":28,"style":29,"_key":329},[],[325],{"_key":326,"_type":38,"marks":327,"text":328},"e96fade80749",[],"I was bleeding from my episiotomy, and I recall looking over at the suction bottle, seeing it rather full of my blood, and calmly asking the anaesthetist if I was having a post-partum haemorrhage…to which he calmly replied, ‘yes, and we’re just going to give you some blood if that’s okay!’. After my episiotomy had been sutured and we left theatre, the midwives said they could weigh and check the babies later after more skin-to-skin. At this point I requested they quickly be weighed before returning for skin-to-skin as I was too curious to know their weights. Both were just over 4kg each – I knew they weren’t going to be small, but I was amazed (and so was everyone else I think) that I’d grown twins that size!","da662d4d7254",{"markDefs":331,"children":332,"_type":28,"style":29,"_key":337},[],[333],{"text":334,"_key":335,"_type":38,"marks":336},"So, my birth did not go according to my plan A. I had pictured a home waterbirth and instead had a forceps birth in theatre, with an episiotomy and a PPH…oh and a dash of transient kidney damage in there too. I absolutely would have preferred them to have been born at home, in a slightly more straightforward manner, but that is not my birth story this time. What surprised me the most is how good I felt about my birth experience despite it being so off plan. It’s the type of birth that possibly looks ‘traumatic’ on paper, but that is not how I experienced it at all. I was very aware that the decisions I made could lead to more interventions (which they did) – but I felt very in control of making those decisions and crucially I felt supported and respected by the hospital staff. I never thought I would have an epidural, I never thought I would be requesting vaginal examinations…and I definitely never thought I would say I was happy with a hospital birth experience involving forceps and an episiotomy (okay episiotomies are still horrible, no two ways about that!) – but I made peace with the birth experience very quickly.","2a66c9f527ce",[],"cf9e9163fe3d",{"markDefs":339,"children":340,"_type":28,"style":29,"_key":345},[],[341],{"text":342,"_key":343,"_type":38,"marks":344},"I’m so glad I declined induction (repeatedly..!) and waited for labour to start spontaneously and that I started my labour at home, with just Sam and Natasha. I think these things put me in good stead for having a vaginal birth – and having a vaginal birth was important to me. I would absolutely be planning a home birth again if I have another baby but I’m glad I was able to make the choice during this labour to transfer to hospital when I felt like I needed it.","7cbf7e9b6516",[],"12224fd5ed3d","z99y3OM7Icwo4EuvFWMrg7",{"_type":15,"asset":348},{"_ref":349,"_type":18},"image-3aa49c403e684b45d794a23870bc5069899caa97-640x480-jpg","birthStory","2025-03-23T16:10:13Z",{"_updatedAt":353,"image":354,"publishedAt":357,"content":358,"slug":415,"title":417,"_rev":418,"_id":419,"_type":350,"_createdAt":420},"2025-04-02T20:21:41Z",{"_type":15,"asset":355},{"_type":18,"_ref":356},"image-19d59cd701d464a17100cff3f6b3f81c988fa021-480x640-jpg","2024-09-01T19:52:00.000Z",[359,367,375,383,391,399],{"_key":360,"markDefs":361,"children":362,"_type":28,"style":29},"6387388473f6",[],[363],{"_key":364,"_type":38,"marks":365,"text":366},"3b1d965dba57",[],"I had never even considered I could have a home birth as it was my first pregnancy. It was a screening of a documentary of “Birth at Home” at our local cinema, hosted by Juno Midwives and two local doulas that truly opened my eyes. As soon as it finished I knew I wanted to home birth and I believed I could do it. Even when most of my friends and family smiled gently saying “well you can plan but..”, or “good luck with your inevitable transfer to hospital” or “with your first? That’s brave!”.",{"children":368,"_type":28,"style":29,"_key":373,"markDefs":374},[369],{"_key":370,"_type":38,"marks":371,"text":372},"5a26516b251a",[],"I started to think I might be a bit naive but I made sure I did my research. And one thing Juno midwives did from the off was completely leave the decisions up to me. Nothing forced, everything explained in terms of hospital policies vs NICE guidelines and I actually felt pretty empowered. I no longer felt like a passenger in a system where I would people please but could assess everything offered to me and question it. Quietly, I started to put the trust in my own body and instincts and declined some of the “routine” procedures. I had NHS care up until 37 weeks when Natasha took over. Our appointments happened at home, on the sofa which built a truly trusting relationship. The pool was dropped off, the gas and air and a tens machine stayed downstairs. My partner and I did a hypnobirthing course together and I spent time preparing myself with affirmations and long baths listening to the hypnobirthing tracks.","08c9b72ab0b4",[],{"markDefs":376,"children":377,"_type":28,"style":29,"_key":382},[],[378],{"marks":379,"text":380,"_key":381,"_type":38},[],"I sailed passed my due date and my anxiety went up, but Natasha’s didn’t. She just kept reassuring me I wouldn’t be pregnant forever. Week 41 came, then plus one, then plus two, then plus 3. The constant messaging from well meaning friends and family was extremely testing and many anecdotal mentions of an inevitable induction Those few days were really trying and emotional. On day 4, out for a walk, I bumped into Natasha and wryly said “I don’t think it’s going to be tonight”. Another 10 minutes of walking and my back became so painful so I decided to head home. By which point I was having cramps. At 4.30ish I bounced on my ball watching episodes of Motherland and excitedly said to my partner “I think I might be in early labour” who was pottering round the house and did a last minute dash to Tesco.","3af4a98d1ccc","12050486da9b",{"_type":28,"style":29,"_key":384,"markDefs":385,"children":386},"b62d2273f755",[],[387],{"_type":38,"marks":388,"text":389,"_key":390},[],"By 10pm everything had ramped up pretty quickly and I was pacing the house with the tens machine on and breathing it out. I asked Natasha to come thinking she may just arrive, check in, and go home and leave me to it. But my contractions were intense so she said she wasn’t going to leave and asked my partner to fill the pool. Things continued to ramp up and I couldn’t seem to get any relief between surges, I used gas and air and side lay on my bed. I was desperate to get in the pool to be weightless and it was such a relief when I did. I laboured most of the night in the pool, contractions coming thick and fast. I was mostly unaware of Natasha and her second midwife Frances. I didn’t have any internal examinations, no cervix measurements, I was just left to my instincts. My partner was by my side the whole time, reading letters from friends, Natasha every now again asked to listen to the baby with the doppler and in between surges would encourage me to rest. With each surge all I remember hearing were reminders to breathe and that I was doing really well.","cf7cfc89b168",{"style":29,"_key":392,"markDefs":393,"children":394,"_type":28},"faf5128afa9d",[],[395],{"_key":396,"_type":38,"marks":397,"text":398},"e2de47263fe9",[],"Eventually Natasha told me to feel between my legs, the baby’s head was there, it was such an amazing feeling that things were happening. My labour started to stall a bit, we later learned my baby was back to back and taking a long time to turn. I had drank an awful lot but hadn’t emptied my bladder. Natasha gently suggested a walk to the bathroom and trying to wee might just get things going again. As soon as I sat on the toilet the urge to push was overpowering. After a little while on the toilet Natasha asked to listen in to baby and as she did she sprung into action. Turns out the baby was very much on the way out. Natasha and my partner lifted me off the toilet and helped me onto all fours. A few more pushes and some excellent encouragement from Natasha and Frances I stayed in the zone, focussed on their words and they passed my baby boy between my legs and my partner and I held him together on our bathroom floor. We all walked through to the bedroom where Frances had already prepared the bed with plenty of cushions where we had loads of skin to skin. Natasha and Frances cleaned up, cleaned me up, helped deliver the placenta and were so calm. I had a second degree tear and a postpartum haemorrhage of 600ml*, but everything was dealt with in my room, no transfer to hospital was needed. It was dreamy. We all had coffee and flapjacks while they finished up the notes and my partner and I just lay in bed and marvelled at the incredible, powerful home birth I’d just had. With my first baby!",{"markDefs":400,"children":401,"_type":28,"style":29,"_key":414},[],[402,406,410],{"_key":403,"_type":38,"marks":404,"text":405},"cd627b964aaf",[],"*",{"marks":407,"text":408,"_key":409,"_type":38},[90],"NB from Juno: a blood loss of 500m","3f80aac1c758",{"_key":411,"_type":38,"marks":412,"text":413},"9ad5788b847e",[],"l – 1000ml is considered a minor postpartum haemorrhage (PPH). Some women and birthing people can have minor PPH and be completely unaffected, others may be symptomatic – everyone is different. Continuity of carer, combined with good midwifery skills, plays an important role in distinguishing between those who are unaffected by a PPH and those who need further care.","9c013f8e4792",{"_type":177,"current":416},"alice-patricks-home-birth","Alice & Patrick’s Home Birth","ukgNSnK508MvTPETucioGE","5e43a832-170f-4238-88db-b96d4af76923","2025-04-02T20:19:03Z",{"content":422,"image":487,"_createdAt":490,"_id":491,"publishedAt":492,"title":493,"_rev":494,"slug":495,"_updatedAt":497,"_type":350},[423,431,439,447,455,463,471,479],{"_key":424,"markDefs":425,"children":426,"_type":28,"style":29},"83af53cd1ba9",[],[427],{"_key":428,"_type":38,"marks":429,"text":430},"76577f6d3b25",[],"I contacted Juno Midwives late on a Sunday evening, at 37 weeks pregnant, in a state of panic. After visiting my local hospital that day, I was very sure that the only place I felt safe enough to give birth, where I’d be most comfortable and where I could create the optimum environment, was in the sanctuary of my own home.",{"style":29,"_key":432,"markDefs":433,"children":434,"_type":28},"a0949ea72a30",[],[435],{"text":436,"_key":437,"_type":38,"marks":438},"Sophie and Natasha responded straight away to my email, and within 48 hours had visited myself and my husband, Adam, and we were good to go. The birth pool was sourced, the fairy lights were up, and I made a playlist of my favourite music. We ordered a TENS machine, went on lots of walks, and I bounced on a birthing ball, all whilst listening to daily relaxation tapes and positive mantras. Sophie and Natasha took over my care, and visited me on a weekly basis, creating a personal bond that gave me complete confidence going towards my due date.","8c9a14f6a701",[],{"children":440,"_type":28,"style":29,"_key":445,"markDefs":446},[441],{"text":442,"_key":443,"_type":38,"marks":444},"5 days over, I had a chat with Sophie regarding my options. Sophie was happy to let me carry on for as long as I was comfortable, given that our baby seemed quite happy, and I too was well. As it turned out, I didn’t have to wait long at all! The following day I started to experience mild cramping, and as the day progressed these started to intensify to average period like pains.","ee88bc498c64",[],"7b75dc7d4eda",[],{"children":448,"_type":28,"style":29,"_key":453,"markDefs":454},[449],{"_key":450,"_type":38,"marks":451,"text":452},"97b820216c75",[],"Sophie pre-warned me, that I would know when I was in labour, as I would go off my food. With a half-eaten quiche left on my plate, Adam made the call. By 1am the TENS machine was on my back, the contractions were coming quicker, and the playlist was on. My mucus plug (unbeknownst to me) had fallen out, and I made myself as comfortable as possible on the sofa. With Sophie frequently monitoring myself and baby, Adam took control of the TENs machine, buzzing whenever I told him to, and eventually my waters broke.","5eeef9dbd0eb",[],{"markDefs":456,"children":457,"_type":28,"style":29,"_key":462},[],[458],{"_type":38,"marks":459,"text":460,"_key":461},[],"Whilst I stayed in my zone, breathing through each contraction, Sophie and Adam set up the birth pool in the corner of our living room, and by 4am I was relaxing in the warm water, just as Natasha arrived. I continued with my breathing techniques, and started to push when I felt the urge. Sophie and Natasha were there throughout, never intruding, but also keeping an eye on both myself and our baby. Natasha stepped in to hold my hand as Adam and Sophie refilled the deflating pool (an unexpected occurrence met with calmness and laughter!)","9db6d70f9ae0","f47922be4195",{"_type":28,"style":29,"_key":464,"markDefs":465,"children":466},"c9471222df42",[],[467],{"_type":38,"marks":468,"text":469,"_key":470},[],"Just as the sun rose, our beautiful baby boy, Louis, was born. Sophie and Natasha helped me and Louis onto the sofa, where we had skin to skin for hours, and Louis started to feed. Sophie and Natasha quietly tidied up as Adam dished out the doughnuts, and they stayed well into the early afternoon. Juno Midwives continued with our postnatal care for the following two weeks, coming to visit (for often over 2 hours at a time) for the first five days, then every other day, until it was time to say goodbye.","70cf933755d4",{"_type":28,"style":29,"_key":472,"markDefs":473,"children":474},"03ce74fa865a",[],[475],{"_type":38,"marks":476,"text":477,"_key":478},[],"Contacting Juno Midwives was the best decision we’ve ever made. Sophie and Natasha enabled me and Adam to have the birth of dreams. I felt genuinely cared for from the moment I met them, and most importantly I felt heard. Sophie and Natasha respected my wishes, were kind and compassionate at all times; and always asked for my consent, meaning I always felt in control. There was never any need for an internal examination during my labour, which allowed me to maintain my concentration, and stay within my birthing zone. Because of this, I never required gas & air, nor suffered any tears. I’ve personally come away from the experience on a high, and feel confident I could do it all again, with Sophie and Natasha by my side.","e119cddc47b2",{"children":480,"_type":28,"style":29,"_key":485,"markDefs":486},[481],{"_key":482,"_type":38,"marks":483,"text":484},"e1d5a5bf8b17",[],"To have a birth where your midwives are with you at all times, supporting you and making you feel safe, feels like a privilege, and we feel very blessed to have had the birth experience we had, along with the amazing aftercare. Sophie and Natasha brought joy and excitement into our home, and will remain life-long friends.","571412fc6842",[],{"asset":488,"_type":15},{"_type":18,"_ref":489},"image-624b4dcb3d76bbeb544d5e19a66cebe286761576-1120x1208-jpg","2025-04-02T20:20:04Z","2cf287ff-425a-44dd-bc53-2fb1be3a2366","2024-02-01T20:52:00.000Z","Brooke & Adam’s Home Birth Story","z99y3OM7Icwo4EuvFWM2mW",{"current":496,"_type":177},"brooke-adams-home-birth-story","2025-04-02T20:20:37Z",{"_type":350,"content":499,"publishedAt":548,"_createdAt":549,"_rev":550,"slug":551,"_updatedAt":553,"image":554,"title":557,"_id":558},[500,508,516,524,532,540],{"_type":28,"style":29,"_key":501,"markDefs":502,"children":503},"3b62fd2ee2aa",[],[504],{"text":505,"_key":506,"_type":38,"marks":507},"When I found out I was pregnant, I knew this time, I really wanted a home birth. We were so lucky to be introduced to our independent midwives, Sophie and Natasha, by lovely local doula, Betty.","ab12caef7d16",[],{"_type":28,"style":29,"_key":509,"markDefs":510,"children":511},"1d80e350ca13",[],[512],{"_type":38,"marks":513,"text":514,"_key":515},[],"Sophie and Natasha are absolutely amazing – they were with us every step of the way. I felt safe, informed and cared for over the last weeks of my pregnancy – nothing was too big or too small (or too silly) to ask them. In no time, we felt like we’d made two firm friends!","d3f7a1e47fd6",{"children":517,"_type":28,"style":29,"_key":522,"markDefs":523},[518],{"_key":519,"_type":38,"marks":520,"text":521},"31e40537f377",[],"My active labour was quite quick – it was just two hours from the time I took a mirror bump selfie and sent it to my sisters (earphones in and happily dancing in my bedroom to my Spotify playlist on repeat), to the time Magnus Rex was born in the birth pool at 8:16pm and I caught him instinctively. I put it down to me feeling completely safe and supported at home. I had Tim by my side, hypnobirthing and breathing techniques under my belt, fairy lights on and the ultimate space and trust from those around me to just listen to my body and go with it. Iris, my firstborn, was upstairs sleeping. Sophie and Natasha checked my baby when needed – but gave me space to trust my body and follow my instincts every step of the way. No prompting to push. No time restrictions. No intervention.","373a44fb848a",[],{"_key":525,"markDefs":526,"children":527,"_type":28,"style":29},"0e805746fc5b",[],[528],{"_key":529,"_type":38,"marks":530,"text":531},"fae3652ddc1b",[],"After Magnus was born, my blood pressure dropped suddenly – and the girls sprung into action quickly – after such continuity of care, they knew me and my normal – and so they knew when something wasn’t quite right. I felt very lucky to have them.",{"children":533,"_type":28,"style":29,"_key":538,"markDefs":539},[534],{"text":535,"_key":536,"_type":38,"marks":537},"All the questions, new parent worries, feeding support and hormone crashes in my postnatal sessions – they put my mind at rest. Coming to visit me at home always felt easy and relaxed. After our last session, I already missed their happy faces, their unofficial Lucy & Yak uniforms, and our giggles over a cup of tea!","d736981864e0",[],"3b91058b363f",[],{"_key":541,"markDefs":542,"children":543,"_type":28,"style":29},"6ab91b60de5f",[],[544],{"_type":38,"marks":545,"text":546,"_key":547},[],"Thank you Natasha and Sophie for helping me to have the positive, powerful birth I had dreamt of. For holding space for me and Tim – to enable Magnus to be born safely (in his bedroom) at home. We’ll be forever grateful.","9bd951088b5a","2023-06-01T19:52:00.000Z","2025-04-02T20:20:58Z","x1toMDq9RBHnqzSAnUoFac",{"_type":177,"current":552},"lizzie-tims-home-birth-story","2025-04-02T20:21:26Z",{"_type":15,"asset":555},{"_ref":556,"_type":18},"image-b779a164f82d68e4f96ba5a8cd698e42324d1164-1024x682-jpg","Lizzie & Tim’s Home Birth Story","a6ff0d24-4e3b-4590-8143-9d1a6648a31f",1743669552784]